000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. DWNMONTH.
000300* SIMPLE HELLO WORLD PROGRAM UPDATED FOR MATH
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000600 01  W1-COUNTERS.
000700     05 DAY-COUNT        PIC 999   VALUE  0.
           05 TOTAL-DAYS       PIC 999   VALUE  0.
           05 WEEK-COUNT       PIC 999   VALUE  0.
           05 TOTAL-WEEKS      PIC 999   VALUE  0.
           05 REMAINING-MONTHS PIC 999   VALUE  12.
000800 PROCEDURE DIVISION.
000900 PAR1.
001000     ADD 1 TO DAY-COUNT
           ADD 1 TO TOTAL-DAYS
001100     IF DAY-COUNT > 7
001200         GO TO PAR2
001300     ELSE
001400         DISPLAY DAY-COUNT 'HELLO WORLD! DAY#' TOTAL-DAYS
001500         GO TO PAR1
001600     END-IF.
001700 PAR2.
           ADD 1 TO WEEK-COUNT
           ADD 1 TO TOTAL-WEEKS
           IF WEEK-COUNT < 4
               SUBTRACT 7 FROM DAY-COUNT
               GO TO PAR1
           ELSE
               DISPLAY TOTAL-WEEKS 'WEEKS HAVE PASSED!'
               GO TO PAR3
             END-IF.
        PAR3.
           SUBTRACT 1 FROM  REMAINING-MONTHS
           IF REMAINING-MONTHS < 1
           DISPLAY 'PROGRAM END' TOTAL-DAYS TOTAL-WEEKS
               GO TO PAR4
           ELSE
               DISPLAY REMAINING-MONTHS 'MONTHS REMAINING.'
               SUBTRACT 4 FROM WEEK-COUNT
               SUBTRACT 7 FROM DAY-COUNT
               GO TO PAR1
           END-IF.
        PAR4.
001800     STOP RUN.
